tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU debugger
brew "gdb"
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU Pretty Good Privacy (PGP) package
brew "gpg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Python dependency management tool
brew "pipenv"
brew "pygments"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
cask "azure-data-studio"
cask "dotnet-sdk"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "gpg-suite"
cask "keybase"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
cask "visual-studio-code-insiders"
mas "Bear", id: 1091189122
mas "Kindle", id: 405399194
mas "Microsoft To Do", id: 1274495053
mas "OmniFocus", id: 1346203938
mas "Pixelmator Pro", id: 1289583905
mas "Soulver", id: 413965349
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
